# To describe all "brew" commands:
#
# ~/bin/brewfile-describe.rb Brewfile
# or
# ruby $HOME/.local/share/chezmoi/exact_bin/executable_brewfile-describe.rb $HOME/.local/share/chezmoi/dot_config/Brewfile

tap '1password/tap'
tap 'abhimanyu003/sttr'
tap 'context-labs/mactop', 'https://github.com/context-labs/mactop'
tap 'dave1010/clipea'
tap 'facebook/fb'
tap 'homeport/tap'
tap 'jakehilborn/jakehilborn'
tap 'jandedobbeleer/oh-my-posh'
tap 'jdxcode/tap'
tap 'JohannesKaufmann/tap'
tap 'kylef/formulae'
tap 'mvp/uhubctl', 'https://github.com/mvp/uhubctl'
tap 'samwho/spacer'
tap 'withgraphite/tap'
tap 'ycd/tap'

# Tools for working with text files
brew 'bat' # Clone of cat(1) with syntax highlighting and Git integration
brew 'choose-rust' # Human-friendly and fast alternative to cut and (sometimes) awk
brew 'dfc' # Display graphs and colors of file system space/usage
brew 'eza' # Modern replacement for 'ls'
brew 'fd' # Simple, fast and user-friendly alternative to find
brew 'fswatch' # Monitor a directory for changes and run a shell command
brew 'fzf' # Command-line fuzzy finder written in Go
brew 'liblockfile' # Library providing functions to lock standard mailboxes
brew 'moreutils' # Collection of tools that nobody wrote when UNIX was young
brew 'oh-my-posh' # Prompt theme engine for any shell
brew 'sd' # Intuitive find & replace CLI
brew 'sttr' # A cross-platform, cli app to perform various string operations.
brew 'television' # General purpose fuzzy finder TUI
brew 'coreutils'
brew 'sleepwatcher'

# Shell power-ups
brew 'atuin' # Improved shell history for zsh and bash
brew 'chezmoi' # Manage your dotfiles across multiple diverse machines, securely
brew 'gcal' # Program for calculating and printing calendars
brew 'mactop' # Apple Silicon Monitor Top written in Go Lang
brew 'noti' # Trigger notifications when a process completes
brew 'nushell' # Modern shell for the GitHub era
brew 'p7zip' # 7-Zip (high compression file archiver) implementation
brew 'pstree' # Show ps output as a tree
brew 'spacer' # Small command-line utility for adding spacers to command output
brew 'tldr' # Simplified and community-driven man pages
brew 'tree' # Display directories as trees (with optional color/HTML output)
brew 'figlet'

# GNU tools
brew 'findutils' # Collection of GNU find, xargs, and locate
brew 'gawk' # GNU awk utility
brew 'gnu-indent' # C code prettifier
brew 'gnu-sed' # GNU implementation of the famous stream editor
brew 'gnu-tar' # GNU version of the tar archiving utility
brew 'grep' # GNU grep, egrep and fgrep

# Tools for networking
brew 'aria2' # Download with resuming and segmented downloading
brew 'curlie' # curl alternative with syntax highlighting and more
brew 'doggo' # Command-line DNS Client for Humans
brew 'dstp' # Run common networking tests against your site
brew 'mtr' # 'traceroute' and 'ping' in a single tool
brew 'nmap' # Port scanning utility for large networks
brew 'wget' # Internet file retriever

# Other shell tools
brew 'displayplacer' # macOS command line utility to configure multi-display resolutions and arrangements. Essentially XRandR for macOS.
brew 'graphviz' # Graph visualization software from AT&T and Bell Labs
brew 'mas' # Mac App Store command-line interface
brew 'shellcheck' # Static analysis and lint tool, for (ba)sh scripts
brew 'html2markdown'

# Tools for package management
brew 'mise' # Multi-language runtime manager
brew 'direnv' # Load/unload environment variables based on $PWD

# GenAI
brew 'ollama' # Create, run, and share large language models (LLMs)
cask 'github-copilot-for-xcode'

# Tools for version control
brew 'ctags' # Reimplementation of ctags(1)
brew 'gh' # GitHub command-line tool
brew 'git-delta' # Syntax-highlighting pager for git and diff output
brew 'git-extras' # Small git utilities
brew 'git-lfs' # Git extension for versioning large files
brew 'git' # Distributed revision control system
brew 'git-town' # High-level command-line interface for Git
brew 'graphite' # Allows you to manage your stacked changes and submit them for review on GitHub

# Tools for developers
brew 'tokei' # Program that allows you to count code, quickly
cask 'fork' # GIT client
cask 'gitup' # Git interface focused on visual interaction
cask 'kaleidoscope' # Spot and merge differences in text and image files or folders
cask 'mitmproxy' # Intercept, modify, replay, save HTTP/S traffic
cask 'sublime-merge' # Git client
cask 'temurin' # JDK from the Eclipse Foundation (Adoptium)
brew 'golang' # Open source programming language to build simple/reliable/efficient software

# Search tools
brew 'the_silver_searcher' # Code-search similar to ack
brew 'rga' # Wrapper around ripgrep that adds multiple rich file types
brew 'ugrep' # Ultra fast grep with query UI, fuzzy search, archive search, and more

# Diff tools
brew 'colordiff' # Color-highlighted diff(1) output
brew 'diff-so-fancy' # Good-lookin' diffs with diff-highlight and more

# YAML/JSON tools
brew 'fastgron' # High-performance JSON to GRON converter
brew 'jless' # Command-line pager for JSON data
brew 'jo' # JSON output from a shell
brew 'jq' # Lightweight and flexible command-line JSON processor
brew 'yq' # Process YAML, JSON, XML, CSV and properties documents from the CLI
brew 'dyff' # δyƒƒ /ˈdʏf/ - A diff tool for YAML files, and sometimes JSON
brew 'dasel' # JSON, YAML, TOML, XML, and CSV query and modification tool
brew 'libyaml' # YAML Parser
brew 'fx'

# Docker
brew 'docker-compose'
brew 'colima'

# Markdown tools
brew 'glow' # Render markdown on the CLI

# Tools for Xcode
brew 'xcbeautify' # Little beautifier tool for xcodebuild
brew 'xcenv' # Xcode version manager
brew 'xcinfo' # Tool to get information about and install available Xcode versions
brew 'xcodes' # Best command-line tool to install and switch between multiple versions of Xcode
brew 'chisel' # Collection of LLDB commands to assist debugging iOS apps
brew 'xcode-build-server'
cask 'xcodes' # Install and switch between multiple versions of Xcode
brew 'swift-sh'
brew 'idb-companion'

# Tools for working with media files
brew 'ffmpeg' # Play, record, convert, and stream audio and video
brew 'graphicsmagick' # Image processing tools collection

# Tools for shell and command-line completion
brew 'brew-cask-completion' # Fish completion for brew-cask
brew 'bundler-completion' # Bash completion for Bundler
brew 'gem-completion' # Bash completion for gem
brew 'gradle-completion' # Bash and Zsh completion for Gradle
brew 'launchctl-completion' # Bash completion for Launchctl
brew 'maven-completion' # Bash completion for Maven
brew 'open-completion' # Bash completion for open
brew 'pip-completion' # Bash completion for Pip
brew 'ruby-completion' # Bash completion for Ruby
brew 'yarn-completion' # Bash completion for Yarn
brew 'zsh-completion' # Additional completion definitions for zsh

# Tools for cryptography
brew 'openssl' # Cryptography and SSL/TLS Toolkit
brew 'gpg' # GNU Pretty Good Privacy (PGP) package
brew 'gpg2' # GNU Pretty Good Privacy (PGP) package
brew 'pinentry-mac' # Pinentry for GPG on Mac

cask 'font-0xproto-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-input'
cask 'font-code-new-roman-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-droid-sans-mono-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-fantasque-sans-mono-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-fira-code-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-geist-mono-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-inconsolata-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-iosevka-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-jetbrains-mono-nerd-font' # Developer targeted fonts with a high number of glyphs
cask 'font-monaspace-nerd-font'
cask 'font-sf-mono-for-powerline' # Apple's SF Mono font patched with the Nerd Fonts patcher for Powerline support
cask 'font-ubuntu-nerd-font' # Developer targeted fonts with a high number of glyphs

# QuickLook plugins
cask 'provisionql' # QuickLook plugin for mobile apps and provisioning profiles
cask 'qlimagesize' # Display image info and preview unsupported formats in QuickLook
cask 'qlprettypatch' # QuickLook plugin to view patch files
cask 'qlvideo' # Thumbnails, static previews, cover art and metadata for video files
cask 'quicklook-csv' # QuickLook plugin for CSV files
cask 'quicklook-json' # QuickLook plugin for JSON files
cask 'quicklookapk' # Quick Look plugin for Android packages
cask 'webpquicklook' # QuickLook plugin for webp files
cask 'syntax-highlight' # Quicklook extension for source files

# Tools for productivity and automation
cask '1password-cli' # Command-line interface for 1Password
cask 'android-file-transfer' # Transfer files from and to an Android smartphone
cask 'contexts' # Allows switching between application windows
cask 'daisydisk' # Disk space visualizer
cask 'handbrake' # Open-source video transcoder
cask 'karabiner-elements' # Keyboard customizer
cask 'keyboard-maestro' # Automation software
cask 'mac-mouse-fix' # Mouse utility to add gesture functions and smooth scrolling to 3rd party mice
cask 'macwhisper' # Speech recognition tool
cask 'openrgb' # Open source RGB lighting control that doesn't depend on manufacturer software
cask 'raycast' # Control your tools with a few keystrokes
cask 'rectangle-pro' # Window snapping tool
cask 'retcon' # Drag-and-drop Git history editor
cask 'rocket' # Emoji picker optimized for blind people
cask 'setapp' # Collection of apps available by subscription
cask 'typora' # Configurable document editor that supports Markdown
cask 'cap'
cask 'superkey'

# Hardware
brew 'uhubctl'
cask 'elgato-stream-deck' # Assign keys, and then decorate and label them
cask 'elgato-control-center' # Control your Elgato key lights
cask 'yubico-authenticator' # Application for generating TOTP and HOTP codes
cask 'focusrite-control-2' # Focusrite interface controller for devices of the 4th generation and newer

cask 'soundsource'
cask 'loopback'

brew 'libusb', '--head'

# Browsers
cask 'firefox'
cask 'brave-browser@beta'
cask 'zen-browser@twilight'

cask 'iterm2' # Terminal emulator as alternative to Apple's Terminal app
cask 'itermai' # Enable generative AI features in iTerm2
cask 'macvim' # Text editor
cask 'zed' # Multiplayer code editor
cask 'ghostty@tip' # Terminal emulator that uses platform-native UI and GPU acceleration
cask 'cursor'

cask 'obs' # Open-source software for live streaming and screen recording

mas 'Amphetamine', id: 937_984_704
mas 'DevCleaner for Xcode', id: 1_388_020_431
mas 'Drafts', id: 1_435_957_248
mas 'Pixelmator Pro', id: 1_289_583_905
mas 'Things 3', id: 904_280_696
mas 'Messenger', id: 1_480_068_668
mas 'Dropover', id: 1_355_679_052
# mas 'RocketSim', id: 1_504_940_162
mas 'Windows App', id: 1_295_203_466
